'use strict';

// 1 задание
let tmpCelcius = Number(prompt('Температура в градусах цельсия'));

alert(`Температура по фаренгейту = ${(9 / 5) * tmpCelcius + 32}`);


//2 задание

let admin, name;
name = 'Василий';
admin = name;
alert(admin);

//3 задание
// 1000108

//4 задание

// async - Загружает скрипт не прирывая отображение страницы. Выполнится когда загрузиться
// defer - Загружает скрипт не прирывая отображение страницы. Выполнится когда загрузиться и когда отобразиться вся страница, сохраняет очередность выполнения скриптов